//Math

// abs()
// let a = 25;
// console.log(Math.abs(a));


// min(),max()
// console.log(Math.min());

// ceil()
// console.log(Math.ceil(5.1));


// floor()

// console.log(Math.floor(5))


// round()

// console.log(Math.round(1.4))

// random()
// console.log(Math.random(0,100));

// pow()

// console.log(Math.pow(2,10));

//Тригонометрические функции

// console.log(Math.cos(12));
// console.log(Math.sin(13));



// Math

//Функция abs() возвращает абсолютное значение числа:

//Функции min() и max() возвращают соответственно минимальное и максимальное значение из набора чисел:

//Функция ceil() округляет число до следующего наибольшего целого числа:

//Функция floor() округляет число до следующего наименьшего целого числа:

//Функция round() округляет число до следующего наименьшего целого числа, если его десятичная часть меньше 0.5. Если же десятичная часть равна или больше 0.5, то округление идет до ближайшего наибольшего целого числа:

//Функция random() возвращает случайное число с плавающей точкой их диапазона от 0 до 1:

//Функция pow() возвращает число в определенной степени. Например, возведем число 2 в степень 3:

//Целый ряд функций представляют тригонометрические функции: sin() (вычисляет синус угла), cos() (вычисляет косинус угла), tan() (вычисляет тангенс угла).
































